{
    "contents": [
      {
        "id": 1,
        "title": "1/ Beginnings",
        "image": "sunset.jpg",
        "post": "As of 2 weeks ago I am now ~fun-employed~, jk I didn't mean to say that. But the sentiment is true: I indeed do not have an employer and am hoping to have some fun.\n\nThe question now is what do I intend to do?\n\nFor a little back story, I'll go ahead and tell you what I've been telling my friends and if you are a friend then you already know:\n\nMy boyfriend and I recently moved back to the U.S. after living in London for 1.5 years. I left the company I was previously working for since they're based in the UK and this has brought me to my current free flowing state.\n\nMy boyfriend has always dreamed of /planned to taking a year off to travel in his mid-twenties and I've known this for years. At first I was extremely uneasy about this - I've grown up learning from my parents the importance of a stable job and a steady income (classic Asian) and I shuddered at the thought of more money going out than coming in - living off of your savings for fun?! Who does that?? \n\nWelp as it turns out, I do that. And despite having enough saved up to last a while without an actual income, I still feel insecure without one. In reality, what is one year without an income for me? It means if I want to make a big purchase in the future (i.e. a house, a new car), I would probably have to buy it a year later than originally planned. It also means I would need to cut down on unnecessary clothing purchases and eat out less, cook more. and just overall be more aware of my day-to-day spendings. I know, these affects are pretty soft when I line them up like that. The point is, in actuality, a year without an income is not as daunting and unthinkable as I sometimes think it is, and that should give me temporarily relief from the financial stress we are constantly tied down to.\n\nNow that my financial fears are sorted, if I take a break from work, how will I advance in my career??!?!\n\nI have always viewed my twenties as my \"learning\" years - if I was going to have a period where I spend the most time and effort on work, this is it. No true obligations, no children dependent on me, and in my mind, a whole lot of energy that I can dedicate to learning. Most people in the same \"track\" of life as me probably share the same mindset here.\n\nBut as I've left and began different post-college chapters, I've started to ask myself: what am I learning now, what am I trying to learn next, and is this the opportune time for it?\n\nMore specifically: is another year in this environment going to teach me what I want to learn?\n\nWell... what am I trying to learn? \n\nIn short, I want to get involved and gain a better understanding on what's happening in the \"real world\" - the world that we're living in that exists outside of my direct line of sight. While living in SF I had this feeling that I was living in a magical bubble, everything was stirring around me but my thoughts were consumed by my day-to-day —-: work, friends, eating,  repeat. When I moved to London I felt this sensation that the people around me were aware of what was going on - perhaps it was the close proximity to neighboring countries or the mix of different cultures.  I suddenly felt like the issues that felt so far away before were now my issues too. And I think this goes hand in hand with everything that has happened so far in 2020: the BLM movement, coronavirus, the 2020 elections etc. It feels like such a pivotal time for the world right now, so a personal shift feels like the right thing to do.\n\nI have always believed there is a right time for everything for each person. For my situation, a break between jobs feels very natural and justifiable, and taking the time to learn topics that I have previously shied away from or brushed off for later makes all the more sense. \n\nSo, with all that backstory said, I'm hoping to start diving deeper into topics that are important to me. Some might be serious, others more light hearted and I hope you will join me in the learning process on this site! With everything that's going on, I truthfully don't know how long this break will last and if we will be able to fulfill our dream of spending a year traveling, but regardless I hope to see a lot of sights, experience a couple of golden moments and learn along the way.\n\nSo anyways, all that being said - I truthfully have no idea now long this break will last. It could be only a couple months if international borders don't open up, or it could be over a year."
      },
      {
        "id": 2,
        "title": "Fires Everywhere",
        "image": "sunset.jpg",
        "post": "Doggo ipsum borkdrive much ruin diet you are doing me the shock the neighborhood pupper doggorino length boy many pats, boofers heckin shooberino wrinkler. Very good spot very jealous pupper very hand that feed shibe smol, shoob. Long bois pupper doggo you are doin me a concern big ol yapper, smol boof most angery pupper I have ever seen puggorino. Mlem blep wow very biscit dat tungg tho wow very biscit, thicc ur givin me a spook. Many pats heckin you are doing me the shock corgo ur givin me a spook very hand that feed shibe shooberino, big ol pupper doge pats borkdrive. Such treat what a nice floof super chub such treat, smol thicc. Puggorino very good spot most angery pupper I have ever seen you are doing me the shock big ol pupper porgo corgo shoober, heckin good boys lotsa pats noodle horse very taste wow thicc. What a nice floof long doggo blep length boy borking doggo, much ruin diet floofs borkf."
      }
    ]
  }